spacemacs/private/dpom/local/dpom/DPom.org
#+TITLE: DPom
#+DESCRIPTION: my specific functions and commands
#+STARTUP: overview

* Implementation

I split the package in 2 parts:
- utils :: utility functions load with =required=
- commands :: commands load with =autoload=

** Utils
*** coding-hook functions
These belong in coding-hook:

We have a number of turn-on-* functions since it's advised that lambda
functions not go in hooks. Repeatedly evaling an add-to-list with a
hook value will repeatedly add it since there's no way to ensure
that a lambda doesn't already exist in the list.
#+name: coding-hook
#+begin_src emacs-lisp
(defun local-column-number-mode ()
  (make-local-variable 'column-number-mode)
  (column-number-mode t))

(defun local-comment-auto-fill ()
  (set (make-local-variable 'comment-auto-fill-only-comments) t)
  (auto-fill-mode t))

(defun turn-on-hl-line-mode ()
  (if window-system (hl-line-mode t)))

(defun turn-on-save-place-mode ()
  (setq save-place t))

(defun turn-on-whitespace ()
  (whitespace-mode t))

(defun turn-off-tool-bar ()
  (tool-bar-mode -1))
#+end_src

*** org
#+name: org-utils
#+begin_src emacs-lisp
  (defun dpom-clock-in-to-started (kw)
  "Switch task from TODO to STARTED when clocking in.
  Skips capture tasks and tasks with subtasks"
  (if (and (string-equal kw "TODO")
           (not (and (boundp 'org-capture-mode) org-capture-mode)))
      (let ((subtree-end (save-excursion (org-end-of-subtree t)))
            (has-subtask nil))
        (save-excursion
          (forward-line 1)
          (while (and (not has-subtask)
                      (< (point) subtree-end)
                      (re-search-forward "^\*+ " subtree-end t))
            (when (member (org-get-todo-state) org-not-done-keywords)
              (setq has-subtask t))))
        (when (not has-subtask)
          "STARTED"))))
#+end_src

*** csv
#+name: csv-utils
#+begin_src emacs-lisp
(defun dpom-csv-buffer-to-list ()
  "Return a list wich elements are current buffer lines starting from point"
  (let (result start)
    (while (not (eobp))
      (setq start (line-beginning-position))
      (end-of-line)
      (setq result (append result (list
                                   (buffer-substring-no-properties
                                    start (point)))))
      (forward-line 1))
    result))


(defun dpom-csv-to-list (&optional sep)
  "Convert a csv buffer in a list. Each element of the list is a
  list containing csv fields."
  (mapcar #'(lambda (x)
              (split-string x (or sep ",")))
          (dpom-csv-buffer-to-list)))


(defun dpom-csv-file-to-list (file &optional separator)
    "Convert a csv file FILE in a list. Each element of the list is a
  list containing csv fields."
  (with-temp-buffer
    (insert-file-contents file)
    (goto-char (point-min))
    (dpom-csv-to-list separator)))


(defsubst dpom-csv-string-trim (string seq)
  "Lose leading and trailing whitespace.  Also remove all properties
from string."
  (if (string-match (concat "\\`[" seq "]+") string)
      (setq string (substring string (match-end 0))))
  (if (string-match (concat "[" seq "]+\\'") string)
      (setq string (substring string 0 (match-beginning 0))))
  (set-text-properties 0 (length string) nil string)
  string)
#+end_src

*** Utils Main Block

#+name: dpom-utils
#+begin_src emacs-lisp :tangle dpom-utils.el :padline no :noweb yes :results silent
<<coding-hook>>
<<org-utils>>
<<csv-utils>>

(provide 'dpom-utils)
#+end_src
** Commands
*** Custom variables
In order to find more easy my  custom variables I define a group =dpom=:

#+name: custom-variables
#+begin_src emacs-lisp
  (defgroup dpom nil
    "My custom variables"
    :version "1.0"
    :group 'tool)

  (defcustom  dpom-doc-dir "~/pers/doc/"
    "Documentation repository"
    :type '(string)
    :group 'dpom)
#+end_src

*** Global commands
#+name: global-comands
#+begin_src emacs-lisp
  ;;;###autoload
  (defun dpom-insert-day ()
    "Insert a day using calendar"
    (interactive)
    (require 'org)
    (insert (format "%s" (org-read-date nil nil nil "Day"))))

  ;;;###autoload
  (defun dpom-comment-or-uncomment-current-line-or-region ()
    "Comments or uncomments current current line or whole lines in region."
    (interactive)
    (save-excursion
      (let (min max)
        (if (and transient-mark-mode mark-active)
            (setq min (region-beginning) max (region-end))
          (setq min (point) max (point)))
        (comment-or-uncomment-region
         (progn (goto-char min) (line-beginning-position))
         (progn (goto-char max) (line-end-position))))))

  ;;;###autoload
  (defun dpom-get-doc-file ()
    "Find a a doc file using."
    (interactive)
    (let ((doc (completing-read "Choose document: "
                                    (mapcar  'file-name-sans-extension  (directory-files dpom-doc-dir nil ".*\.org$"))
                                    nil t)))
      (when doc
        (find-file (expand-file-name (concat doc ".org") dpom-doc-dir)))))

  ;;;###autoload
  (defun dpom-eshell-execute-current-line ()
    "Insert text of current line in eshell and execute."
    (interactive)
    (require 'eshell)
    (let ((command (buffer-substring
                    (save-excursion
                      (beginning-of-line)
                      (point))
                    (save-excursion
                      (end-of-line)
                      (point)))))
      (let ((buf (current-buffer)))
        (unless (get-buffer eshell-buffer-name)
          (eshell))
        (display-buffer eshell-buffer-name t)
        (switch-to-buffer-other-window eshell-buffer-name)
        (goto-char (point-max))
        (eshell-kill-input)
        (insert command)
        (eshell-send-input)
        (goto-char (point-max))
        (switch-to-buffer-other-window buf))))

    ;;;###autoload
  (defun untabify-buffer ()
    (interactive)
    (untabify (point-min) (point-max)))

    ;;;###autoload
  (defun indent-buffer ()
    (interactive)
    (indent-region (point-min) (point-max)))

    ;;;###autoload
  (defun cleanup-buffer ()
    "Perform a bunch of operations on the whitespace content of a buffer."
    (interactive)
    (indent-buffer)
    (untabify-buffer)
    (delete-trailing-whitespace))

  (defun eval-and-replace ()
    "Replace the preceding sexp with its value."
    (interactive)
    (backward-kill-sexp)
    (condition-case nil
        (prin1 (eval (read (current-kill 0)))
               (current-buffer))
      (error (message "Invalid expression")
             (insert (current-kill 0)))))

  ;; (defun eval-and-replace (value)
  ;;   "Evaluate the sexp at point and replace it with its value"
  ;;   (interactive (list (eval-last-sexp nil)))
  ;;   (kill-sexp -1)
  ;;   (insert (format "%S" value)))

  ;; Cosmetic

    ;;;###autoload
  (defun pretty-lambdas ()
    (font-lock-add-keywords
     nil `(("(?\\(lambda\\>\\)"
            (0 (progn (compose-region (match-beginning 1) (match-end 1)
                                      ,(make-char 'greek-iso8859-7 107))
                      nil))))))


    ;;;###autoload
  (defun sudo-edit (&optional arg)
    (interactive "p")
    (if (or arg (not buffer-file-name))
        (find-file (concat "/sudo:root@localhost:" (read-file-name "File: ")))
      (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))

  ;; A monkeypatch to cause annotate to ignore whitespace
    ;;;###autoload
  (defun vc-git-annotate-command (file buf &optional rev)
    (let ((name (file-relative-name file)))
      (vc-git-command buf 0 name "blame" "-w" rev)))


    ;;;###autoload
  (defun sm-try-smerge ()
    (save-excursion
      (goto-char (point-min))
      (when (re-search-forward "^<<<<<<< " nil t)
        (smerge-mode 1))))
#+end_src

*** Tags
#+name: tags
#+begin_src emacs-lisp
  ;;;###autoload
  (defun dpom-create-tags (dir-name)
      "Create tags file."
      (interactive "DDirectory: ")
      (shell-command
       (format "%s -f %s/TAGS -e -R %s" "/usr/bin/ctags"  dir-name (directory-file-name dir-name)))
    )
#+end_src
