spacemacs/private/dpom/local/dpom/dpom-commands.el
(require 'dpom-utils)
(require 'esh-mode)
(require 'eshell)
(require 'org)
(require 'imenu)
(require 'thingatpt)

  (defgroup dpom nil
    "My custom variables"
    :version "1.0"
    :group 'tool)

  (defcustom  dpom-doc-dir "~/pers/doc/"
    "Documentation repository"
    :type '(string)
    :group 'dpom)
  ;;;###autoload
  (defun dpom-insert-day ()
    "Insert a day using calendar"
    (interactive)
    (require 'org)
    (insert (format "%s" (org-read-date nil nil nil "Day"))))

  ;;;###autoload
  (defun dpom-comment-or-uncomment-current-line-or-region ()
    "Comments or uncomments current current line or whole lines in region."
    (interactive)
    (save-excursion
      (let (min max)
        (if (and transient-mark-mode mark-active)
            (setq min (region-beginning) max (region-end))
          (setq min (point) max (point)))
        (comment-or-uncomment-region
         (progn (goto-char min) (line-beginning-position))
         (progn (goto-char max) (line-end-position))))))

  ;;;###autoload
  (defun dpom-get-doc-file ()
    "Find a a doc file using."
    (interactive)
    (let ((doc (completing-read "Choose document: "
                                    (mapcar  'file-name-sans-extension  (directory-files dpom-doc-dir nil ".*\.org$"))
                                    nil t)))
      (when doc
        (find-file (expand-file-name (concat doc ".org") dpom-doc-dir)))))

  ;;;###autoload
  (defun dpom-eshell-execute-current-line ()
    "Insert text of current line in eshell and execute."
    (interactive)
    (require 'eshell)
    (let ((command (buffer-substring
                    (save-excursion
                      (beginning-of-line)
                      (point))
                    (save-excursion
                      (end-of-line)
                      (point)))))
      (let ((buf (current-buffer)))
        (unless (get-buffer eshell-buffer-name)
          (eshell))
        (display-buffer eshell-buffer-name t)
        (switch-to-buffer-other-window eshell-buffer-name)
        (goto-char (point-max))
        (eshell-kill-input)
        (insert command)
        (eshell-send-input)
        (goto-char (point-max))
        (switch-to-buffer-other-window buf))))

    ;;;###autoload
  (defun untabify-buffer ()
    (interactive)
    (untabify (point-min) (point-max)))

    ;;;###autoload
  (defun indent-buffer ()
    (interactive)
    (indent-region (point-min) (point-max)))

    ;;;###autoload
  (defun cleanup-buffer ()
    "Perform a bunch of operations on the whitespace content of a buffer."
    (interactive)
    (indent-buffer)
    (untabify-buffer)
    (delete-trailing-whitespace))

  (defun eval-and-replace ()
    "Replace the preceding sexp with its value."
    (interactive)
    (backward-kill-sexp)
    (condition-case nil
        (prin1 (eval (read (current-kill 0)))
               (current-buffer))
      (error (message "Invalid expression")
             (insert (current-kill 0)))))

  ;; (defun eval-and-replace (value)
  ;;   "Evaluate the sexp at point and replace it with its value"
  ;;   (interactive (list (eval-last-sexp nil)))
  ;;   (kill-sexp -1)
  ;;   (insert (format "%S" value)))

  ;; Cosmetic

    ;;;###autoload
  (defun pretty-lambdas ()
    (font-lock-add-keywords
     nil `(("(?\\(lambda\\>\\)"
            (0 (progn (compose-region (match-beginning 1) (match-end 1)
                                      ,(make-char 'greek-iso8859-7 107))
                      nil))))))


    ;;;###autoload
  (defun sudo-edit (&optional arg)
    (interactive "p")
    (if (or arg (not buffer-file-name))
        (find-file (concat "/sudo:root@localhost:" (read-file-name "File: ")))
      (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))

  ;; A monkeypatch to cause annotate to ignore whitespace
    ;;;###autoload
  (defun vc-git-annotate-command (file buf &optional rev)
    (let ((name (file-relative-name file)))
      (vc-git-command buf 0 name "blame" "-w" rev)))


    ;;;###autoload
  (defun sm-try-smerge ()
    (save-excursion
      (goto-char (point-min))
      (when (re-search-forward "^<<<<<<< " nil t)
        (smerge-mode 1))))
  ;;;###autoload
  (defun dpom-create-tags (dir-name)
      "Create tags file."
      (interactive "DDirectory: ")
      (shell-command
       (format "%s -f %s/TAGS -e -R %s" "/usr/bin/ctags"  dir-name (directory-file-name dir-name)))
    )
  ;;;###autoload
