spacemacs/private/dpom/local/dpom/dpom-commands.el
(defun dpom-org-surround-block (beg end &optional tag)
  (interactive "r")
  (if (not tag) (setq tag (read-string "type: ")))
  (save-restriction
    (narrow-to-region beg end)
    (goto-char (point-min))
    (insert "#+begin_" tag "\n")
    (goto-char (point-max))
    (insert "#+end_" tag "\n")))

  ;;;###autoload
(defun dpom-org-surround-src (beg end)
  (interactive "r")
  (dpom-org-surround-block beg end "src"))

  ;;;###autoload
(defun dpom-babel (beg end)
  (interactive "r")
  (babel-region beg end t))

  ;;;###autoload
(defun dpom-org-surround-example (beg end)
  (interactive "r")
  (dpom-org-surround-block beg end "example"))

  ;;;###autoload
(defun bh/org-agenda-to-appt ()
  "Erase all reminders and rebuilt reminders for today from the agenda"
  (interactive)
  (setq appt-time-msg-list nil)
  (org-agenda-to-appt))

  ;;;###autoload
(defun dpom-org-manual ()
  (interactive)
  (info "~/.emacs.d/info/org"))

  ;;;###autoload
(defun dpom-screenshot ()
  "Take a screenshot into a unique-named file in the current buffer file
  directory and insert a link to this file."
  (interactive)
  (let ((filename (concat (make-temp-name (file-name-directory (buffer-file-name))) ".jpg" )))
    (call-process "import" nil nil nil filename)
    (insert (concat "[[" filename "]]"))
    (org-display-inline-images)))


;;;###autoload
(defun dpom-insert-file-as-org-table (filename)
  "Insert a csv file (; separator) into the current buffer at point, and convert it to an org table."
  (interactive (list (read-file-name "csv file: ")))
  (let* ((start (point))
         (end (+ start (nth 1 (insert-file-contents filename)))))
    (save-restriction
      (narrow-to-region start end)
      (goto-char (point-min))
      (while (search-forward ";" nil t) (replace-match "|"))
      )
    (org-table-convert-region start end)
    ))
;;;###autoload
(defun dpom-org-babel-detangle (&optional source-code-file)
  "Propagate changes in source file back original to Org-mode file.
This requires that code blocks were tangled with link comments
which enable the original code blocks to be found."
  (interactive)
  (save-excursion
    (when source-code-file (find-file source-code-file))
    (message "detangled %d code blocks" (dpom-org-babel-detangle-region (point-min) (point-max)))))


(defun dpom-org-babel-detangle-region (beg end)
  (save-excursion
    (goto-char beg)
    (let ((counter 0) new-body start next)
      (while (re-search-forward org-bracket-link-analytic-regexp end t)
        (setq start (match-end 0))
        (when (re-search-forward (concat " " (regexp-quote (match-string 5)) " ends here"))
          (setq next (match-end 0))
          (forward-line -1)
          (if (dpom-org-babel-contain-embedded-src-p start next)
              (setq counter (+ counter (dpom-org-babel-detangle-region start next)))
            (save-excursion
              (when (setq new-body (org-babel-tangle-jump-to-org))
                (org-babel-update-block-body new-body)
                (setq counter (+ 1 counter))))))
          (goto-char next))
      counter)))


(defun dpom-org-babel-contain-embedded-src-p (beg end)
  "Return true if there are source blocks embedded."
  (save-excursion
      (goto-char beg)
      (if (re-search-forward org-bracket-link-analytic-regexp end t) t nil)))

(defun dpom-test-org-babel-contain-embedded-src-p (beg end)
  (interactive "r")
  (message "dpom-org-babel-contain-embedded-src-p result: %s" (dpom-org-babel-contain-embedded-src-p beg end)))
