spacemacs/private/dpom/local/dpom/DPom.org
*** XML

#+name: xml-commands
#+begin_src emacs-lisp
(defcustom dpom-xml-schema-list ()
  "Validation schema list"
  :type 'list
  :group 'dpom)

(defvar dpom-log-buffer (concat "*Dpom-Log*")
  "Log buffer")

;;;###autoload
(defun dpom-format-xml (arg)
  (interactive "P")
  "Entry point for xml formating commands. Without an argument
nice indent the xml file, with argument compact it"
  (if (null arg) (dpom-indent-xml) (dpom-compact-xml)))

(defun dpom-compact-xml (&optional file)
  "Suppress all white spaces between > and < from the current buffer"
  (goto-char (point-min))
  (while (re-search-forward ">[ \n\t]*<" nil t)
    (replace-match "><" nil nil)))


(defun dpom-indent-xml (&optional file)
  "Prety indent the current xml buffer"
  (goto-char (point-min))
  (while (re-search-forward "><" nil t)
    (replace-match ">\n<" nil nil))
  (goto-char (point-min))
  (while (not (= (point) (point-max)))
    (indent-for-tab-command)
    (forward-line)))

;;;###autoload
(defun dpom-complete-surround-tag (beg end)
  (interactive "r")
  (let ((tag (read-string "tag: ")))
    (save-restriction
      (narrow-to-region beg end)
      (goto-char (point-min))
      (insert "<" tag ">\n")
      (goto-char (point-max))
      (insert "</" tag ">\n"))))

;;;###autoload
(defun dpom-get-xpath (&optional print-message)
  "Return all the elements in the ancestor axis of the current
    element.  If called interactively, show it in the echo area."
  (interactive "p")
  (nxml-ensure-scan-up-to-date)
  (let ((path (mapconcat #'(lambda (x) x) (xml-remove-complete-elements (xml-get-tags (current-buffer) (point))) "/")))
    (when print-message
      (message "%s" path))
    (kill-new path)
    path))


(defun xml-get-tags (buf pos)
  "Get all start/end tags from begining of BUF till POS."
    (set-buffer buf)
    (goto-char pos)
    (setq pos (search-forward ">"))
    (goto-char (point-min))
    (let ((ellist ()))
      (while (and (re-search-forward "<\\([^?]/?[a-z-A-Z]*\\)" nil t)
                  (< (point) pos))
        (setq ellist (cons (substring-no-properties (match-string 1)) ellist)))
      ellist))

(defun xml-remove-complete-elements (lst)
  "Remove complete elements start/end tags from LST."
  (let ((acc ())
        (tag nil))
    (mapc #'(lambda (x)
              (if (null tag)
                  (if (equal ?/ (elt x 0)) (setq tag (substring x 1))(setq acc (cons x acc)))
                (if (string= tag x) (setq tag nil))))
          lst)
    acc))



;; add msv to the systems list for the error alist creation
(defvar compilation-error-regexp-alist-alist)
(defvar compilation-error-regexp-alist)
(defvar msv-error-regexp
  '(msv "^\\(Fatal \\)?[Ee]rror at line:\\([0-9,]+\\), column:\\([0-9]+\\) of file:\\(.+\\)" 4 2 3))

(unless (assq 'msv  compilation-error-regexp-alist-alist)
  (setq compilation-error-regexp-alist-alist (cons msv-error-regexp compilation-error-regexp-alist-alist)))

(setq compilation-error-regexp-alist (mapcar 'car compilation-error-regexp-alist-alist))



;;;###autoload
(defun dpom-validate-xml (&optional file)
  "Validate current xml buffer"
  (interactive)
  (if (null file) (setq file (file-name-nondirectory buffer-file-name)))
  (compile (concat "xmlValidate"
                   " " (expand-file-name (cdr (assoc (completing-read "Schema: " dpom-xml-schema-list)
                                                     dpom-xml-schema-list)))
                   " " (expand-file-name file)) t))

;;;###autoload
(defun dpom-use-xsl-with-outfile (&optional file)
  "Use the actual xsl buffer or the FILE to transform an xml file.
The result is saved in a file."
  (interactive)
  (if (null file) (setq file (file-name-nondirectory buffer-file-name)))
  (compile (concat "xmlTransform"
                   " " (expand-file-name file)
                   " " (expand-file-name (read-file-name "Xml file: "))
                   " " (expand-file-name (read-file-name "Output file: ")))
                    t))

;;;###autoload
(defun dpom-use-xsl (&optional file)
  "Use the actual xsl buffer or the FILE to transform an xml file."
  (interactive)
  (if (null file) (setq file (file-name-nondirectory buffer-file-name)))
  (compile (concat "xmlTransform"
                   " " (expand-file-name file)
                   " " (expand-file-name (read-file-name "Xml file: ")))
                    t))



(defun dpom-log (log &rest args)
  "Log a message or the contents of a buffer.
If LOG is a string and there are more args, it is formatted with
those ARGS.  Usually the LOG string ends with a \n.  End each
bunch of errors with (dpom-log t): this inserts the current time
and buffer at the start of the page, and \f (formfeed) at the
end."
  (let ((obuf (current-buffer)))
    (with-current-buffer (get-buffer-create dpom-log-buffer)
      (goto-char (point-max))
      (let ((inhibit-read-only t))
        (cond ((stringp log)
               (insert (if args
                           (apply (function format) log args)
                         log)))
              ((bufferp log)
               (insert-buffer-substring log))
              ((eq t log)
               (goto-char (point-max))
               (insert "\n\n")
               (insert (current-time-string) "\n")))
          (sit-for 0)))))
#+end_src

*** Translate
 I need a command to in-line translate. It should works on selected region or last word if it isn't a selection and should replace the selected text with the translation.

#+name: translate-commands
#+begin_src emacs-lisp
  (require 'url-handlers)

  (defun babel-url-retrieve (url)  ;; return a buffer
    (let* ((url-show-status nil)
           (tmp (url-retrieve-synchronously url)))
      (unless (cadr (url-insert tmp))
        (mm-decode-coding-region (point-min) (point-max) 'utf-8))
      (kill-buffer tmp)))

  (babel-url-retrieve "http://translate.google.com/#ro|en|acasa")
#+end_src

aceasta traducere

*** Commands Main Block
#+name: dpom-commands
#+begin_src emacs-lisp :tangle dpom-commands.el :padline no :noweb yes :results silent
(require 'dpom-utils)
(require 'esh-mode)
(require 'eshell)
(require 'org)
(require 'imenu)
(require 'thingatpt)

<<custom-variables>>
<<global-comands>>
<<tags>>
<<org-commands>>
<<org-detangle>>
<<lisp-commands>>
<<xml-commands>>

(provide 'dpom-commands)
#+end_src


* Tasks
** TODO [#C] study the setup example                                       :net:
   SCHEDULED:
                                                                    :PROPERTIES:
   :Effort:   0:30
                                                                    :ID:       1744C4F7-FFC2-4E2D-B798-25B2D3F00026
                                                                           :END:
   #+begin_src emacs-lisp
;; emacs setup

(add-to-list 'load-path "~/.emacs.d/el-get/el-get")
(require 'el-get)
(setq
 el-get-sources
 '(el-get
   php-mode-improved
   psvn
   auto-complete
   switch-window

   (:name buffer-move
          :after (lambda ()
                   (global-set-key (kbd "<C-S-up>")     'buf-move-up)
                   (global-set-key (kbd "<C-S-down>")   'buf-move-down)
                   (global-set-key (kbd "<C-S-left>")   'buf-move-left)
                   (global-set-key (kbd "<C-S-right>")  'buf-move-right)))

   (:name magit
          :after (lambda ()
                   (global-set-key (kbd "C-x C-z") 'magit-status)))

   (:name goto-last-change
          :after (lambda ()
                   ;; azerty keyboard here, don't use C-x C-/
                   (global-set-key (kbd "C-x C-_") 'goto-last-change)))))

(when window-system
   (add-to-list 'el-get-sources  'color-theme-tango))

(el-get 'sync)

;; visual settings
(setq inhibit-splash-screen t)
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)

(line-number-mode 1)
(column-number-mode 1)

;; Use the clipboard, pretty please, so that copy/paste "works"
(setq x-select-enable-clipboard t)

(set-frame-font "Monospace-10")

(global-hl-line-mode)

;; suivre les changements exterieurs sur les fichiers
(global-auto-revert-mode 1)

;; pour les couleurs dans M-x shell
(autoload 'ansi-color-for-comint-mode-on "ansi-color" nil t)
(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)

;; S-fleches pour changer de fenêtre
(windmove-default-keybindings)
(setq windmove-wrap-around t)

;; find-file-at-point quand ça a du sens
(setq ffap-machine-p-known 'accept) ; no pinging
(setq ffap-url-regexp nil) ; disable URL features in ffap
(setq ffap-ftp-regexp nil) ; disable FTP features in ffap
(define-key global-map (kbd "C-x C-f") 'find-file-at-point)

(require 'ibuffer)
(global-set-key "\C-x\C-b" 'ibuffer)

;; use iswitchb-mode for C-x b
(iswitchb-mode)

;; I can't remember having meant to use C-z as suspend-frame
(global-set-key (kbd "C-z") 'undo)

;; winner-mode pour revenir sur le layout précédent C-c <left>
(winner-mode 1)

;; dired-x pour C-x C-j
(require 'dired-x)

;; full screen
(defun fullscreen ()
  (interactive)
  (set-frame-parameter nil 'fullscreen
                       (if (frame-parameter nil 'fullscreen) nil 'fullboth)))
(global-set-key [f11] 'fullscreen)

   #+end_src
** CANCELLED [#C] See how to remove the insecure link message from w3m :computer:
   SCHEDULED: <2012-03-03 Sat>
                                                                       :LOGBOOK:
   - State "CANCELLED"  from "TODO"       [2012-03-05 Mon 17:02] \\
     nu ma deranjeaza asa de mult
                                                                           :END:
                                                                    :PROPERTIES:
   :Effort:   0:30
                                                                    :ID:       ADCEEA74-F5FE-47DD-A2EF-6B177C95F45C
                                                                           :END:
   [2010-09-29 Wed]
** DONE [#A] export contacts to gogle
SCHEDULED: <2012-08-03 Fri>
:LOGBOOK:
- State "DONE"       from "STARTED"    [2012-08-08 Wed 15:56]
CLOCK: [2012-08-07 Tue 18:58]--[2012-08-07 Tue 19:32] =>  0:34
CLOCK: [2012-08-07 Tue 15:51]--[2012-08-07 Tue 16:14] =>  0:23
CLOCK: [2012-08-07 Tue 15:29]--[2012-08-07 Tue 15:32] =>  0:03
CLOCK: [2012-08-07 Tue 15:12]--[2012-08-07 Tue 15:16] =>  0:04
CLOCK: [2012-08-07 Tue 14:16]--[2012-08-07 Tue 14:48] =>  0:32
CLOCK: [2012-08-07 Tue 13:15]--[2012-08-07 Tue 14:03] =>  0:48
CLOCK: [2012-08-07 Tue 12:18]--[2012-08-07 Tue 12:48] =>  0:30
CLOCK: [2012-08-03 Fri 15:52]--[2012-08-03 Fri 15:56] =>  0:04
CLOCK: [2012-08-03 Fri 14:28]--[2012-08-03 Fri 15:07] =>  0:39
:END:


* COMMENT Setup
  #+STARTUP: logdone
  #+PROPERTY: Effort_ALL  0:10 0:20 0:30 1:00 2:00 4:00 6:00 8:00
  #+COLUMNS: %38ITEM(Details) %TAGS(Context) %7TODO(To Do) %5Effort(Time){:} %6CLOCKSUM{Total}
