spacemacs/private/dpom/local/dpom/dpom-commands.el
(defcustom dpom-xml-schema-list ()
  "Validation schema list"
  :type 'list
  :group 'dpom)

(defvar dpom-log-buffer (concat "*Dpom-Log*")
  "Log buffer")

;;;###autoload
(defun dpom-format-xml (arg)
  (interactive "P")
  "Entry point for xml formating commands. Without an argument
nice indent the xml file, with argument compact it"
  (if (null arg) (dpom-indent-xml) (dpom-compact-xml)))

(defun dpom-compact-xml (&optional file)
  "Suppress all white spaces between > and < from the current buffer"
  (goto-char (point-min))
  (while (re-search-forward ">[ \n\t]*<" nil t)
    (replace-match "><" nil nil)))


(defun dpom-indent-xml (&optional file)
  "Prety indent the current xml buffer"
  (goto-char (point-min))
  (while (re-search-forward "><" nil t)
    (replace-match ">\n<" nil nil))
  (goto-char (point-min))
  (while (not (= (point) (point-max)))
    (indent-for-tab-command)
    (forward-line)))

;;;###autoload
(defun dpom-complete-surround-tag (beg end)
  (interactive "r")
  (let ((tag (read-string "tag: ")))
    (save-restriction
      (narrow-to-region beg end)
      (goto-char (point-min))
      (insert "<" tag ">\n")
      (goto-char (point-max))
      (insert "</" tag ">\n"))))

;;;###autoload
(defun dpom-get-xpath (&optional print-message)
  "Return all the elements in the ancestor axis of the current
    element.  If called interactively, show it in the echo area."
  (interactive "p")
  (nxml-ensure-scan-up-to-date)
  (let ((path (mapconcat #'(lambda (x) x) (xml-remove-complete-elements (xml-get-tags (current-buffer) (point))) "/")))
    (when print-message
      (message "%s" path))
    (kill-new path)
    path))


(defun xml-get-tags (buf pos)
  "Get all start/end tags from begining of BUF till POS."
    (set-buffer buf)
    (goto-char pos)
    (setq pos (search-forward ">"))
    (goto-char (point-min))
    (let ((ellist ()))
      (while (and (re-search-forward "<\\([^?]/?[a-z-A-Z]*\\)" nil t)
                  (< (point) pos))
        (setq ellist (cons (substring-no-properties (match-string 1)) ellist)))
      ellist))

(defun xml-remove-complete-elements (lst)
  "Remove complete elements start/end tags from LST."
  (let ((acc ())
        (tag nil))
    (mapc #'(lambda (x)
              (if (null tag)
                  (if (equal ?/ (elt x 0)) (setq tag (substring x 1))(setq acc (cons x acc)))
                (if (string= tag x) (setq tag nil))))
          lst)
    acc))



;; add msv to the systems list for the error alist creation
(defvar compilation-error-regexp-alist-alist)
(defvar compilation-error-regexp-alist)
(defvar msv-error-regexp
  '(msv "^\\(Fatal \\)?[Ee]rror at line:\\([0-9,]+\\), column:\\([0-9]+\\) of file:\\(.+\\)" 4 2 3))

(unless (assq 'msv  compilation-error-regexp-alist-alist)
  (setq compilation-error-regexp-alist-alist (cons msv-error-regexp compilation-error-regexp-alist-alist)))

(setq compilation-error-regexp-alist (mapcar 'car compilation-error-regexp-alist-alist))



;;;###autoload
(defun dpom-validate-xml (&optional file)
  "Validate current xml buffer"
  (interactive)
  (if (null file) (setq file (file-name-nondirectory buffer-file-name)))
  (compile (concat "xmlValidate"
                   " " (expand-file-name (cdr (assoc (completing-read "Schema: " dpom-xml-schema-list)
                                                     dpom-xml-schema-list)))
                   " " (expand-file-name file)) t))

;;;###autoload
(defun dpom-use-xsl-with-outfile (&optional file)
  "Use the actual xsl buffer or the FILE to transform an xml file.
The result is saved in a file."
  (interactive)
  (if (null file) (setq file (file-name-nondirectory buffer-file-name)))
  (compile (concat "xmlTransform"
                   " " (expand-file-name file)
                   " " (expand-file-name (read-file-name "Xml file: "))
                   " " (expand-file-name (read-file-name "Output file: ")))
                    t))

;;;###autoload
(defun dpom-use-xsl (&optional file)
  "Use the actual xsl buffer or the FILE to transform an xml file."
  (interactive)
  (if (null file) (setq file (file-name-nondirectory buffer-file-name)))
  (compile (concat "xmlTransform"
                   " " (expand-file-name file)
                   " " (expand-file-name (read-file-name "Xml file: ")))
                    t))



(defun dpom-log (log &rest args)
  "Log a message or the contents of a buffer.
If LOG is a string and there are more args, it is formatted with
those ARGS.  Usually the LOG string ends with a \n.  End each
bunch of errors with (dpom-log t): this inserts the current time
and buffer at the start of the page, and \f (formfeed) at the
end."
  (let ((obuf (current-buffer)))
    (with-current-buffer (get-buffer-create dpom-log-buffer)
      (goto-char (point-max))
      (let ((inhibit-read-only t))
        (cond ((stringp log)
               (insert (if args
                           (apply (function format) log args)
                         log)))
              ((bufferp log)
               (insert-buffer-substring log))
              ((eq t log)
               (goto-char (point-max))
               (insert "\n\n")
               (insert (current-time-string) "\n")))
          (sit-for 0)))))

(provide 'dpom-commands)
